Tekla.Structures.Catalogs.ProfileItemParameter
The ProfileItemParameter class contains the information of one profile parameter
(property name, symbol, unit and unit type). A profile item can contain a maximum
of 50 profile parameters.

Tekla.Structures.Catalogs.ProfileItemParameter.Property
The description of the profile item parameter. Corresponds to the 'Property' in the
Tekla Structures profile catalog dialog, and the 'Label in dialog box' in the variable
dialog in the Sketch Editor.

Tekla.Structures.Catalogs.ProfileItemParameter.Value
The value of the profile item parameter.

Tekla.Structures.Catalogs.ProfileItemParameter.StringValue
The string value of the profile item parameter.

Tekla.Structures.Catalogs.ProfileItemParameter.Symbol
The symbol of the profile item parameter.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitType
Defines the parameter unit type.

Tekla.Structures.Catalogs.ProfileItemParameter.CrossSectionNumber
The number of the cross section the parameter belongs to.